In [12]:
import ibm_db
import pandas

In [1]:
#Replace the placeholder values with your actual Db2 hostname, username, and password:
dsn_hostname = "98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud" # e.g.: "54a2f15b-5c0f-46df-8954-7e38e612c2bd.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud"
dsn_uid = "mrv93007"        # e.g. "abc12345"
dsn_pwd = "WBhh14XWm6nOcIhq"      # e.g. "7dBZ3wWt9XN6$o0J"

dsn_driver = "{IBM DB2 ODBC DRIVER}"
dsn_database = "BLUDB"            # e.g. "BLUDB"
dsn_port = "30875"                # e.g. "32733" 
dsn_protocol = "TCPIP"            # i.e. "TCPIP"
dsn_security = "SSL"              #i.e. "SSL"

In [3]:
dsn = (
    "DRIVER={0};"
    "DATABASE={1};"
    "HOSTNAME={2};"
    "PORT={3};"
    "PROTOCOL={4};"
    "UID={5};"
    "PWD={6};"
    "SECURITY={7};").format(dsn_driver, dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd,dsn_security)
#print the connection string to check correct values are specified
print(dsn)

DRIVER={IBM DB2 ODBC DRIVER};DATABASE=BLUDB;HOSTNAME=98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud;PORT=30875;PROTOCOL=TCPIP;UID=mrv93007;PWD=WBhh14XWm6nOcIhq;SECURITY=SSL;

In [15]:
try:
    con = ibm_db.connect(dsn, "", "")
    print ("Connected to database: ", dsn_database, "as user: ", dsn_uid, "on host: ", dsn_hostname)

except:
    print ("Unable to connect: ", ibm_db.conn_errormsg() )

Connected to database:  BLUDB as user:  mrv93007 on host:  98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud

In [8]:
#Construct the query that retrieves all rows from the INSTRUCTOR table
selectQuery = "select * from CHICAGO_CRIME_DATA"

#Execute the statement
selectStmt = ibm_db.exec_immediate(conn, selectQuery)

#Fetch the Dictionary (for the first row only) - replace ... with your code
...

Ellipsis

In [9]:
ibm_db.fetch_both(selectStmt)

{'ID': 3512276,
 0: 3512276,
 'CASE_NUMBER': 'HK587712',
 1: 'HK587712',
 'DATE': datetime.date(2004, 8, 28),
 2: datetime.date(2004, 8, 28),
 'BLOCK': '047XX S KEDZIE AVE',
 3: '047XX S KEDZIE AVE',
 'IUCR': '890',
 4: '890',
 'PRIMARY_TYPE': 'THEFT',
 5: 'THEFT',
 'DESCRIPTION': 'FROM BUILDING',
 6: 'FROM BUILDING',
 'LOCATION_DESCRIPTION': 'SMALL RETAIL STORE',
 7: 'SMALL RETAIL STORE',
 'ARREST': 'FALSE',
 8: 'FALSE',
 'DOMESTIC': 'FALSE',
 9: 'FALSE',
 'BEAT': 911,
 10: 911,
 'DISTRICT': 9,
 11: 9,
 'WARD': 14,
 12: 14,
 'COMMUNITY_AREA_NUMBER': 58,
 13: 58,
 'FBICODE': '6',
 14: '6',
 'X_COORDINATE': 1155838,
 15: 1155838,
 'Y_COORDINATE': 1873050,
 16: 1873050,
 'YEAR': 2004,
 17: 2004,
 'LATITUDE': '41.80744050',
 18: '41.80744050',
 'LONGITUDE': '-87.70395585',
 19: '-87.70395585',
 'LOCATION': '(41.8074405, -87.703955849)',
 20: '(41.8074405, -87.703955849)'}

In [27]:
import pandas
import ibm_db_dbi

In [28]:
pconn = ibm_db_dbi.Connection(conn)

In [30]:
selectQuery = "select * from CHICAGO_CRIME_DATA"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

In [31]:
query= "select count(*) from CHICAGO_CRIME_DATA"

pdf = pandas.read_sql(query, pconn)
pdf

     1
0  533

In [38]:
query= "select CASE_NUMBER from CHICAGO_CRIME_DATA where DESCRIPTION LIKE '%MINOR%'"

pdf = pandas.read_sql(query, pconn)
pdf

  CASE_NUMBER
0    HL266884
1    HK238408

In [42]:
query= "select * from CHICAGO_CRIME_DATA where PRIMARY_TYPE='KIDNAPPING'"

pdf = pandas.read_sql(query, pconn)
pdf

,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,...,DISTRICT,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,LATITUDE,LONGITUDE,LOCATION
0,5276766,HN144152,2007-01-26,050XX W VAN BUREN ST,1792,KIDNAPPING,CHILD ABDUCTION/STRANGER,STREET,FALSE,FALSE,...,15,29,25,20,1143050,1897546,2007,41.874908,-87.750249,"(41.874908413, -87.750249307)"

In [44]:
query= "select PRIMARY_TYPE from CHICAGO_CRIME_DATA where LOCATION_DESCRIPTION LIKE '%SCHOOL%'"

pdf = pandas.read_sql(query, pconn)
pdf

       PRIMARY_TYPE
0           BATTERY
1           BATTERY
2           BATTERY
3           BATTERY
4           BATTERY
5   CRIMINAL DAMAGE
6         NARCOTICS
7         NARCOTICS
8           ASSAULT
9   CRIMINAL TRESPA
10  PUBLIC PEACE VI
11  PUBLIC PEACE VI

In [53]:
query= "SELECT COMMUNITY_AREA_NUMBER ,COUNT(COMMUNITY_AREA_NUMBER) AS FREQUENCY FROM CHICAGO_CRIME_DATA GROUP BY COMMUNITY_AREA_NUMBER ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC LIMIT 1"

pdf = pandas.read_sql(query, pconn)
pdf

   COMMUNITY_AREA_NUMBER  FREQUENCY
0                     25         43

In [54]:
selectQuery = "select * from CENSUS_DATA"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

In [55]:
query="SELECT COMMUNITY_AREA_NAME FROM CENSUS_DATA WHERE PER_CAPITA_INCOME < 11000"
pdf = pandas.read_sql(query, pconn)
pdf

  COMMUNITY_AREA_NAME
0  West Garfield Park
1      South Lawndale
2         Fuller Park
3           Riverdale

In [57]:
query="SELECT COMMUNITY_AREA_NAME, PERCENT_HOUSEHOLDS_BELOW_POVERTY FROM CENSUS_DATA ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC LIMIT 5"

pdf = pandas.read_sql(query, pconn)
pdf

  COMMUNITY_AREA_NAME  PERCENT_HOUSEHOLDS_BELOW_POVERTY
0           Riverdale                              56.5
1         Fuller Park                              51.2
2           Englewood                              46.6
3      North Lawndale                              43.1
4  East Garfield Park                              42.4

In [58]:
query="SELECT COMMUNITY_AREA_NAME FROM  CENSUS_DATA WHERE HARDSHIP_INDEX = (SELECT MAX(HARDSHIP_INDEX) FROM CENSUS_DATA)"

pdf = pandas.read_sql(query, pconn)
pdf

  COMMUNITY_AREA_NAME
0           Riverdale

In [68]:
query="SELECT ELEMENTARY__MIDDLE__OR_HIGH_SCHOOL, AVG(SAFETY_SCORE) AS AVERAGE_SAFETY_SCORE FROM CHICAGO_PUBLIC_SCHOOLS GROUP BY ELEMENTARY__MIDDLE__OR_HIGH_SCHOOL"

pdf = pandas.read_sql(query, pconn)
pdf

  ELEMENTARY__MIDDLE__OR_HIGH_SCHOOL  AVERAGE_SAFETY_SCORE
0                                 ES                    49
1                                 HS                    49
2                                 MS                    48

SyntaxError: invalid syntax (862899813.py, line 1)

In [74]:
query="SELECT COMMUNITY_AREA_NAME FROM CENSUS_DATA WHERE COMMUNITY_AREA_NUMBER = (SELECT COMMUNITY_AREA_NUMBER FROM CHICAGO_CRIME_DATA GROUP BY COMMUNITY_AREA_NUMBER ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC LIMIT 1) LIMIT 1"

pdf = pandas.read_sql(query, pconn)
pdf

  COMMUNITY_AREA_NAME
0              Austin